create table type(
    id serial primary key,
    name varchar(255)
);

create table product(
    id serial primary key,
    name varchar(255),
    type_id integer references type(id),
    expired_date date,
    price float
);

insert into type(name) values ('CЫР'), ('КОЛБАСА'), ('МОЛОКО'), ('РЫБА'), ('МЯСО'), ('МОРОЖЕНОЕ');

insert into product(name, type_id, expired_date, price) values
('Плавленный сыр0', 1, '2022-11-11', 325.5),
('Плавленный сыр1', 1, '2022-11-11', 123.5),
('Плавленный сыр2', 1, '2022-11-11', 435.5),
('Плавленный сыр3', 1, '2022-11-11', 345.5),
('Плавленный сыр4', 1, '2022-11-11', 455.5),
('Плавленный сыр5', 1, '2022-11-11', 655.5),
('Плавленный сыр6', 1, '2022-11-11', 45.5),
('Плавленный сыр7', 1, '2022-11-11', 25.5),
('Плавленный сыр8', 1, '2022-11-11', 35.5),
('Плавленный сыр9', 1, '2022-11-11', 55.5),
('Плавленный сыр10', 1, '2022-11-11', 75.5),
('Плавленный сыр11', 1, '2022-11-11', 825.5),
('Колбасный сыр', 1, '2022-11-14', 225.5),
('Копченая колбаса', 2, '2022-11-23', 725.5),
('Молочная колбаса', 2, '2022-11-15', 317.3),
('Козье молоко', 3, '2022-11-16', 217.3),
('Коровье молоко', 3, '2022-10-17', 117.3),
('Щука', 4, '2022-11-19', 1117.3),
('Карась', 4, '2022-11-11', 317.3),
('Акула', 4, null, 11111117.3),
('Замороженое мясо', 5, '2023-07-22', 617.3),
('Размороженое мясо', 5, '2023-07-22', 617.3),
('Мороженое Cтандарт', 4, '2023-01-01', 11111117.3),
('Мороженое Зайчик', 4, '2023-01-01', 11111117.3);